import thai_lcc

# print(thai_lcc.RE_LTCC)
text = '''ในยุคดิจิทัลทรานส์ฟอร์เมชัน ปัจจุบัน เทคโนโลยีก้าวหน้าไปอย่างรวดเร็ว เอไอ และ แมชชีนเลิร์นนิง มีอิมแพกต์ต่อ บิซิเนสโมเดล อย่างมาก คอมพานีส์ ต่างๆ ต้อง อะแดปต์ เพื่อ สเตย์คอมเพทิทีฟ ใน โกลบอลมาร์เก็ต
คัสโตเมอร์เอ็กซ์พีเรียนซ์ กลายเป็น คีย์แฟกเตอร์ สำคัญ เพอร์ซันนัลไลเซชัน และ ออโตเมชัน ถูกนำมาใช้ใน มาร์เก็ตติงสแตรทิจี เพื่อ ออปติไมซ์คอนเวอร์ชันเรต และ อินครีซคัสโตเมอร์รีเทนชัน
ด้าน ซอฟต์แวร์ดีเวลอปเมนต์ เฟรมเวิร์ก เช่น รีแอคท์, สเวลท์, และ เน็กซ์เจเอส กำลัง เกนป็อปปูลาริตี เพราะ เพอร์ฟอร์แมนซ์ และ เฟล็กซิบิลิตี ส่วน แบ็กเอนด์เทคโนโลยี อย่าง โหนดเจเอส, ซูปาเบส, และ ไฟร์เบส ก็ เอเนเบิล สเกลละเบิลอินฟราสตรัคเจอร์
ซีเคียวริตี ก็สำคัญ ไซเบอร์เธรตส์ เช่น ฟิชชิง และ แรนซัมแวร์แอทแท็ก เพิ่มขึ้นเรื่อยๆ ดังนั้น เดต้าเอนคริปชัน และ มัลติแฟกเตอร์ออเทนทิเคชัน (MFA) เป็น มัสต์แฮฟ
สุดท้าย ลีดเดอร์ชิป ในองค์กรต้อง เอมเบรซอินโนเวชัน และ ฟอสเตอร์คอลแล็บอเรชัน เพื่อ ไดรฟ์ซัสเทนเนเบิลโกรธ ใน อีรา ของ ดิจิทัลดิสรับชัน'''
# text = '''สิทธิ์ลุ้นเครื่องรางของขลังวัดโบสถ์เรืองพันธุ์แท้สำหรับเซียนพระเพรียกใหม่'''
# text = 'เอียร์ดส์เบิร์ธส์เพิร์ลลิง'
# text = 'ไกล้ากว้าง'
# text = 'ล้กทำไม'
text = 'อัฐิของ'
tccs = thai_lcc.segment(text)
print('|'.join(tccs))